<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Provirent-svn-commit] r322 - docu/latex
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/provirent-svn-commit/2005-December/index.html" >
   <LINK REL="made" HREF="mailto:provirent-svn-commit%40lists.berlios.de?Subject=Re%3A%20%5BProvirent-svn-commit%5D%20r322%20-%20docu/latex&In-Reply-To=%3C200512200808.jBK88cHQ008236%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000323.html">
   <LINK REL="Next"  HREF="000325.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Provirent-svn-commit] r322 - docu/latex</H1>
    <B>pschneider at BerliOS</B> 
    <A HREF="mailto:provirent-svn-commit%40lists.berlios.de?Subject=Re%3A%20%5BProvirent-svn-commit%5D%20r322%20-%20docu/latex&In-Reply-To=%3C200512200808.jBK88cHQ008236%40sheep.berlios.de%3E"
       TITLE="[Provirent-svn-commit] r322 - docu/latex">pschneider at berlios.de
       </A><BR>
    <I>Tue Dec 20 09:08:38 CET 2005</I>
    <P><UL>
        <LI>Previous message: <A HREF="000323.html">[Provirent-svn-commit] r321 - docu/latex
</A></li>
        <LI>Next message: <A HREF="000325.html">[Provirent-svn-commit] r323 - docu/latex
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#324">[ date ]</a>
              <a href="thread.html#324">[ thread ]</a>
              <a href="subject.html#324">[ subject ]</a>
              <a href="author.html#324">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: pschneider
Date: 2005-12-20 09:08:26 +0100 (Tue, 20 Dec 2005)
New Revision: 322

Modified:
   docu/latex/5-Fazit.tex
Log:


Modified: docu/latex/5-Fazit.tex
===================================================================
--- docu/latex/5-Fazit.tex	2005-12-20 07:03:10 UTC (rev 321)
+++ docu/latex/5-Fazit.tex	2005-12-20 08:08:26 UTC (rev 322)
@@ -1,13 +1,18 @@
 \chapter{Fazit} \label{sec:Fazit}
-Mit Hilfe dieses Projektes wurde bei allen Projektmitglieder Erfahrungen im Bereich Softwareentwicklung und Softwareplanung gesammelt. Bei diesem Projekt wurde eine eigenst&#228;ndige Idee in die Realit&#228;t umgesetzt, wobei alle Projektmitglieder Ihren Teil dazu beitrugen.
+Mit Hilfe dieses Projektes wurde bei allen Projektmitglieder Erfahrungen im Bereich Softwareplanung und Softwareentwicklung gesammelt. Bei diesem Projekt wurde eine eigenst&#228;ndige Idee in die Realit&#228;t umgesetzt, wobei alle Projektmitglieder dabei intensiv und mit viel Interesse an einer m&#246;glichst guten Realisierung mitarbeiteten.\\
 
 Technologisch gesehen haben sich die Projektmitglieder in Themengebiete gewagt, die ihnen bis dahin zum Teil relativ fremd waren. So wurden im Bereich vom objektrelationalen Mapping &#252;berhaupt die ersten Erfahrungen gesammelt. Dazu wurde die Erkenntnis gewonnen, dass Hibernate ein sehr vorteilhaftes und umfassendes Werkzeug ist, um die Persistenzschicht von der Businessschicht unabh&#228;ngig zu gestalten.\\
-So wurde erreicht, dass diese Persistenzschicht vollst&#228;ndig implementiert werden konnte und f&#252;r den Zugriff aus dem Kundenmodul und dem Verwaltungsmodul zur Verf&#252;gung steht.
+So wurde erreicht, dass diese Persistenzschicht vollst&#228;ndig implementiert werden konnte und f&#252;r den Zugriff aus dem Kundenmodul und dem Verwaltungsmodul zur Verf&#252;gung steht.\\
 
-Weiterhin ist festzustellen, dass die Implementierung des Projekts noch nicht abgeschlossen ist, so dass z.B. noch grundlegende Funktionalit&#228;ten des Kundenmoduls umgesetzt werden m&#252;ssen. Trotzdem konnte und kann hier die Verwendung des Webframeworks Apache Struts dazu beitragen, dass mit relativ wenig Aufwand und Entwicklungszeit die Entwicklung einer 3-schichtigen Webanwendung erm&#246;glicht wird. Dies hat den Vorteil, dass Design, Businesslogik und Daten von einander getrennt dargestellt und umgesetzt werden konnten. 
+Weiterhin ist festzustellen, dass die Implementierung des Projekts noch nicht abgeschlossen ist, so dass z.B. noch grundlegende Funktionalit&#228;ten des Kundenmoduls umgesetzt werden m&#252;ssen. Trotzdem konnte und kann hier die Verwendung des Webframeworks Apache Struts dazu beitragen, dass mit relativ wenig Aufwand und Entwicklungszeit die Entwicklung einer 3-schichtigen Webanwendung erm&#246;glicht wird. Dies hat den Vorteil, dass Design, Businesslogik und Daten von einander getrennt dargestellt und umgesetzt werden konnten.\\
 
 
 
 
-Dieses Projekt k&#246;nnte auch als Grundlage f&#252;r andere Studentenprojekte dienen. Dabei m&#252;ssen die Studenten sich nicht in dieses spezielle Projekt einarbeiten, sondern k&#246;nnen ein selbst&#228;ndiges Modul entwickeln. So k&#246;nnten Studenten bspw. ein Suchmodul mit Apache Lucence oder ein Barcodemodul zur Verarbeitung von Barcodes entwickeln. Weiterhin k&#246;nnte ein Modul zur Erstellung von Rechnungen oder anderen Reports mit Eclipse Birt erstellt werden, ein Modul zur Verwaltung der Standorte/Lagerorte der DVD's oder ein Modul zur Berechnung der k&#252;rzesten Wegstrecke bei der Zusammenstellung einer bzw. mehrerer Bestellungen.
+Durch die Verwendung von Subversion als Versionsverwaltung wurde der Umgang mit einer neuen Technologie schnell zur Gewohnheit. Dadurch ist es f&#252;r die Projektmitglieder zum Alltag geworden, &#196;nderungen sofort f&#252;r alle zu speichern und mit aussagekr&#228;ftigen Kommentaren zu versehen. Durch die netzwerksparende &#220;bertragung von Daten, war auch der Einsatz von Modems m&#246;glich. Durch den  automatischen Versand von Emails wurden andere Projektmitglieder schnell und kompakt &#252;ber &#196;nderungen informiert. Die installation auf einem Windowstestrechner mit einer gesicherter HTTPS-Verbindung gestaltete sich als unkompliziert, wie die Installation einer gesicherten ssh+svn Verbindung auf einem Fedore Core 3 Linux Rechner, dank gut beschriebener Anleitungen.\\
 
+Aufgrund der SWT-Bibliothek konnte eine einfach zu bedienende Benutzeroberfl&#228;che erstellt werden, mit der alle notwendigen Objekte f&#252;r eine Online-Videothek einfach editiert und erstellt werden k&#246;nnen. Aufgrund der verwendeten Reiter f&#252;r jedes Untermen&#252; kann schnell zwischen den einzelnen Men&#252;s umgeschaltet und Ver&#228;nderungen vorgenommen werden. Die verschiedenen Dialogfenster erleichtern die Eingabe f&#252;r den Benutzer und zugleich die Bearbeitung im Quellcode.\\
+
+Dieses Projekt k&#246;nnte auch als Grundlage f&#252;r andere Studentenprojekte dienen. Dabei m&#252;&#223;en die Studenten sich nicht in dieses spezielle Projekt einarbeiten, sondern k&#246;nnen ein selbst&#228;ndiges Modul entwickeln. So k&#246;nnten Studenten bspw. ein Suchmodul mit Apache Lucence entwickeln oder ein Barcodemodul zur Verarbeitung von Barcodes entwickeln. Weiterhin k&#246;nnte ein Modul zur Erstellung von Rechnungen oder anderen Reports mit Eclipse Birt erstellt werden, ein Modul zur Verwaltung der Standorte/Lagerorte der DVD's oder ein Modul zur Berechnung der k&#252;rzesten Wegstrecke bei der Zusammenstellung einer bzw. mehrerer Bestellungen. Jedes dieser Module k&#246;nnte dann mit geringen Aufwand in die Online-Videothek integriert werden.
+
+


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000323.html">[Provirent-svn-commit] r321 - docu/latex
</A></li>
	<LI>Next message: <A HREF="000325.html">[Provirent-svn-commit] r323 - docu/latex
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#324">[ date ]</a>
              <a href="thread.html#324">[ thread ]</a>
              <a href="subject.html#324">[ subject ]</a>
              <a href="author.html#324">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/provirent-svn-commit">More information about the Provirent-svn-commit
mailing list</a><br>
</body></html>
